In [ ]:
  1. 데이터셋  영화 타이틀 데이터 셋. 
      -. moves_title.csv 
  2. titles의 Data Frame을 만든다. 
  3. df 필수 명령 8가지 실행 

  4. 전체 영화는 몇개인가? 
  5. 가장 빠른 시기에 제작된 영화 2개를 찾아라. 
  6. 제목이 "Hamlet"인 영화는 몇개인가? 
  7. 제목이 "Treasure Island"는 몇개인가? 제작년도 오름차순으로 나열
  8. 1950년에서 1959년사이에 만들어진 영화는 몇개인가? 

  다 끝나신분.. numpy quickstart 학습.. 
  https://numpy.org/doc/stable/user/quickstart.html

In [44]:
import numpy as np
import pandas as pd

In [24]:
pip install pandas

Requirement already satisfied: pandas in c:\anaconda3\lib\site-packages (1.2.4)Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: pytz>=2017.3 in c:\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.16.5 in c:\anaconda3\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: six>=1.5 in c:\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [51]:
mt = pd.read_csv("d:/movies_title.csv")

In [52]:
mt.head(4)

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993

In [55]:
mt.tail(5)

                      title  year
215976       Le mouton noir  1922
215977  Edge of the Unknown  2015
215978                E yue  2005
215979         Lakota Girls  2015
215980         The Sting II  1983

In [58]:
mt.columns

Index(['title', 'year'], dtype='object')

In [59]:
mt.shape

(215981, 2)

In [62]:
mt.info

<bound method DataFrame.info of                           title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]>

In [63]:
list(mt.columns)

['title', 'year']

In [66]:
mt.isnull()

        title   year
0       False  False
1       False  False
2       False  False
3       False  False
4       False  False
...       ...    ...
215976  False  False
215977  False  False
215978  False  False
215979  False  False
215980  False  False

[215981 rows x 2 columns]

In [69]:
mt.isnull().sum()

title    0
year     0
dtype: int64

In [71]:
mt.isnull().sum().sum()

0

In [70]:
mt.describe()

                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [81]:
mt['year']

0         1990
1         2016
2         1969
3         1993
4         2015
          ...
215976    1922
215977    2015
215978    2005
215979    2015
215980    1983
Name: year, Length: 215981, dtype: int64

In [82]:
mt['year'].sort_index()

0         1990
1         2016
2         1969
3         1993
4         2015
          ...
215976    1922
215977    2015
215978    2005
215979    2015
215980    1983
Name: year, Length: 215981, dtype: int64

In [85]:
mt['year'].value_counts().sort_values(ascending = False)

2015    13978
2014     8209
2013     7664
2012     7273
2011     6844
        ...
1899        2
2024        2
1903        1
1897        1
1894        1
Name: year, Length: 124, dtype: int64

In [87]:
mt["title"].value_counts().sum()

215981

In [89]:
mt["year"].value_counts().sort_index()
# 1894년 / 1897년

1894     1
1897     1
1899     2
1900     4
1903     1
        ..
2019    46
2020    36
2021     8
2022     3
2024     2
Name: year, Length: 124, dtype: int64

In [90]:
mt.shape[0]

215981

In [91]:
mt.sort_values("year", ascending = True).head(2)

                                                    title  year
165182                                         Miss Jerry  1894
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897

In [95]:
mt[mt["title"] == "Hamlet"].shape[0]

19

In [96]:
len(mt[mt["title"] == "Hamlet"])

19

In [97]:
mt.loc[(mt['title'] == "Hamlet")]

         title  year
5562    Hamlet  1948
26160   Hamlet  2016
37373   Hamlet  2015
42224   Hamlet  1990
43511   Hamlet  1910
68239   Hamlet  1954
85741   Hamlet  1976
87781   Hamlet  1987
87971   Hamlet  2000
91710   Hamlet  1921
114224  Hamlet  1969
154627  Hamlet  1913
163645  Hamlet  2009
169996  Hamlet  1964
186988  Hamlet  1996
192815  Hamlet  2011
195015  Hamlet  1911
205821  Hamlet  1973
207793  Hamlet  2014

In [101]:
mt1 = mt.loc[(mt["title"] == "Treasure Island")].value_counts().sum()
mt1

8

In [103]:
(mt["year"] >= 1950)  & (mt["year"] <= 1959)

0         False
1         False
2         False
3         False
4         False
          ...
215976    False
215977    False
215978    False
215979    False
215980    False
Name: year, Length: 215981, dtype: bool

In [104]:
mt[(mt["year"] >= 1950) & (mt["year"] <=1959)].shape[0]

12120